package com.compoment.addfunction.web;

public class HtmlJS {

	
	public void p() {
		
		//选择器 1.选择器keyvalue(key中文value数字)数据写死  选择一个保存值到数据库
		//      2.选择器keyvalue数据动态   选择一个保存值到数据库
		//		3.选择器keyvalue数据动态    选择一个另外个选择器跟着变
		//		4.选择器keyvalue数据写死    选择一个另外一个或多个控件隐藏
		//      5.选择器keyvalue数据写死     选择一个另外一个图片控件图片切换 ，文字控件值变化，列表控件值变化，超链接控件变
		
		
		
		//必填项左边标红星
		
		
		
		//按钮      1.保存
		//       2.返回
		//       3.清空  图片，文件选择器
		//       4.加入购物车
		//		 5.确认订单
		//		 6.支付(跳转保存接口或数据库)
		//       7.查询(不跳转查询列表)
		//		 8.新增(跳转保存接口或数据库)
		//		 9.修改(跳转查询填值)
		//       10.奖状 (跳转查询列表)
		//       11.订单(跳转查询列表)
		//       12.地址(跳转查询列表)
		
		
		
		
		
		//图片      1.url写死
		//       2.url来源选择器 ，  文件上传器     
	    //       3.点击图片放大
		
		
		
		
		
		
		
		//文字控件
		//          1.动态
		//			2.写死
		
		
		
		//文字编辑器
		//           1.输入时检查是否为数字
		//           2.输入时检查是否为手机号
		//			 3.输入时检查是否为中文
		//		     4.输入时检查是否为身份证号
		//		     5.保存时检查是否为空
		//           6.默认值
		//           7.输入长度限制
		//			 8.提示语
		//			 9.初始值
		
		
		
		
		//日期选择器
		          //1.开始时间小于结束时间
		
		
		
		
		//文件上传器
				//1.预览图片
		
		
		
		
		
		
		
		
		
		
	}
}
